In [2]:
import pandas as pd

In [3]:
train = pd.read_csv('data_city/data_tr_city.csv')
test = pd.read_csv('data_city/data_ts_city.csv')
sample = pd.read_csv('data_city/sample_city.csv')

In [4]:
train.head()

              datetime  구미 혁신도시배수지 유출유량 적산차
0  2017-01-01 01:00:00                138.0
1  2017-01-01 02:00:00                237.0
2  2017-01-01 03:00:00                128.0
3  2017-01-01 04:00:00                 14.0
4  2017-01-01 05:00:00                 11.0

In [5]:
test.head()

              datetime  구미 혁신도시배수지 유출유량 적산차
0  2021-01-01 00:00:00                106.0
1  2021-01-01 01:00:00                184.0
2  2021-01-01 02:00:00                277.0
3  2021-01-01 03:00:00                197.0
4  2021-01-01 04:00:00                 72.0

In [6]:
sample.head(3)

,datetime,h0,h1,h2,h3,h4,h5,h6,h7,h8,...,h326,h327,h328,h329,h330,h331,h332,h333,h334,h335
0,2021-01-01 00:00:00,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,2021-01-01 01:00:00,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,2021-01-01 02:00:00,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [7]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35063 entries, 0 to 35062
Data columns (total 2 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   datetime             35063 non-null  object
 1   구미 혁신도시배수지 유출유량 적산차  35055 non-null  float64
dtypes: float64(1), object(1)
memory usage: 548.0+ KB

### 데이터 전처리

#### 결측치 처리

##### Spline Interpolation (스플라인 보간법)

선형 보간법보다 보간 오차가 더 작고, 고차항의 다항식 보간법보다는 보간 함수가 부드럽고 평가하기 쉬움

In [31]:
from scipy import interpolate

In [36]:
train['구미 혁신도시배수지 유출유량 적산차'] = train['구미 혁신도시배수지 유출유량 적산차'].interpolate(kind = 'quadratic').values

In [38]:
train.isnull().sum()

datetime               0
구미 혁신도시배수지 유출유량 적산차    0
dtype: int64

#### 이상치 처리

🔔 값이 너무 크고, 작은 데이터들을 Noise로 볼 것인지?

In [10]:
train[train['구미 혁신도시배수지 유출유량 적산차'] == train['구미 혁신도시배수지 유출유량 적산차'].min()]

                  datetime  구미 혁신도시배수지 유출유량 적산차
17558  2019-01-02 15:00:00           -6093821.0

In [11]:
train[train['구미 혁신도시배수지 유출유량 적산차'] == train['구미 혁신도시배수지 유출유량 적산차'].max()]

                  datetime  구미 혁신도시배수지 유출유량 적산차
11995  2018-05-15 20:00:00            4720655.0

In [39]:
train['구미 혁신도시배수지 유출유량 적산차'].mean()

123.73910864301399

In [40]:
mu, std = train['구미 혁신도시배수지 유출유량 적산차'].mean(), train['구미 혁신도시배수지 유출유량 적산차'].std()

print("평균:", mu, "표준편차:", std)
print("이상치 갯수:", len(train['구미 혁신도시배수지 유출유량 적산차'][( train['구미 혁신도시배수지 유출유량 적산차']>mu+3*std)|( train['구미 혁신도시배수지 유출유량 적산차']<mu-3*std)]))

평균: 123.73910864301399 표준편차: 43419.75887907574
이상치 갯수: 3

In [41]:
## 이상치 데이터 날짜 확인
train.datetime[train['구미 혁신도시배수지 유출유량 적산차'][(train['구미 혁신도시배수지 유출유량 적산차']>mu+3*std)|(train['구미 혁신도시배수지 유출유량 적산차']<mu-3*std)].index]

2127     2017-03-30 16:00:00
11995    2018-05-15 20:00:00
17558    2019-01-02 15:00:00
Name: datetime, dtype: object